In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
data = {'Country': ['Belgium', 'India', 'Brazil'], 'Capital': ['Brussels', 'New Delhi', 'Brasilia'], 'Population': [11190846, 1303171035, 207847528] }

# Series

In [4]:
s1 = Series(data['Country'], index=['A', 'B', 'C'])

In [5]:
s1

A    Belgium
B      India
C     Brazil
dtype: object

In [6]:
s1.values

array(['Belgium', 'India', 'Brazil'], dtype=object)

In [7]:
s1.index

Index(['A', 'B', 'C'], dtype='object')

In [8]:
df1 = DataFrame(data)

In [9]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [10]:
df1['Country']

0    Belgium
1      India
2     Brazil
Name: Country, dtype: object

In [11]:
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [12]:
s1 = Series(data['Country'])
s2 = Series(data['Capital'])
s3 = Series(data['Population'])

In [13]:
df_new = DataFrame([s1, s2, s3], index=['Country', 'Capital', 'Population'])

In [14]:
df_new

                   0           1          2
Country      Belgium       India     Brazil
Capital     Brussels   New Delhi   Brasilia
Population  11190846  1303171035  207847528

In [15]:
df_new.T

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [16]:
df1

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [17]:
df1 = pd.read_clipboard()

In [18]:
df1

Empty DataFrame
Columns: [CD-207358]
Index: []

In [19]:
df1.to_clipboard()

In [20]:
df1

Empty DataFrame
Columns: [CD-207358]
Index: []

In [21]:
df1.to_csv("df1.csv", index=False)

In [22]:
df2 = pd.read_csv("df1.csv")

In [23]:
df2

Empty DataFrame
Columns: [CD-207358]
Index: []

In [24]:
df1.to_json()

'{"CD-207358":{}}'

In [25]:
df3 = pd.read_json('{"Bills":{"0":"Rent","1":"Car","2":"Credit Cards","3":"Food","4":"Candy","5":"Total"},"Jan-16":{"0":"$1,200.00","1":"$250.00","2":"$400.00","3":"$300.00","4":"$75.00","5":"$2,225.00"},"Feb-16":{"0":"$1,200.00","1":"$250.00","2":"$150.00","3":"$250.00","4":"$75.00","5":"$1,925.00"},"Mar-16":{"0":"$1,200.00","1":"$250.00","2":"$120.00","3":"$350.00","4":"$90.00","5":"$2,010.00"},"Total":{"0":"$3,600.00","1":"$750.00","2":"$670.00","3":"$900.00","4":"$240.00","5":"$6,160.00"},"Percent":{"0":"58.44%","1":"12.18%","2":"10.88%","3":"14.61%","4":"3.90%","5":"100.00%"}}')

In [26]:
df3

          Bills     Jan-16     Feb-16     Mar-16      Total  Percent
0          Rent  $1,200.00  $1,200.00  $1,200.00  $3,600.00   58.44%
1           Car    $250.00    $250.00    $250.00    $750.00   12.18%
2  Credit Cards    $400.00    $150.00    $120.00    $670.00   10.88%
3          Food    $300.00    $250.00    $350.00    $900.00   14.61%
4         Candy     $75.00     $75.00     $90.00    $240.00    3.90%
5         Total  $2,225.00  $1,925.00  $2,010.00  $6,160.00  100.00%

In [27]:
df1.to_html('df1.html', index=False)

In [28]:
df1.to_excel('df1.xlsx', index=False)

In [29]:
imdb = pd.read_csv('resources/movie_metadata.csv')

In [30]:
imdb

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5038,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
5039,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
5040,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
5041,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
5042,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [31]:
imdb.shape()

TypeError: 'tuple' object is not callable

In [32]:
imdb.shape

(5043, 28)

In [33]:
imdb.head()

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000
1,Color,Gore Verbinski,302.0,169.0,563.0,1000.0,Orlando Bloom,40000.0,309404152.0,Action|Adventure|Fantasy,...,1238.0,English,USA,PG-13,300000000.0,2007.0,5000.0,7.1,2.35,0
2,Color,Sam Mendes,602.0,148.0,0.0,161.0,Rory Kinnear,11000.0,200074175.0,Action|Adventure|Thriller,...,994.0,English,UK,PG-13,245000000.0,2015.0,393.0,6.8,2.35,85000
3,Color,Christopher Nolan,813.0,164.0,22000.0,23000.0,Christian Bale,27000.0,448130642.0,Action|Thriller,...,2701.0,English,USA,PG-13,250000000.0,2012.0,23000.0,8.5,2.35,164000
4,NaN,Doug Walker,NaN,NaN,131.0,NaN,Rob Walker,131.0,NaN,Documentary,...,NaN,NaN,NaN,NaN,NaN,NaN,12.0,7.1,NaN,0

In [34]:
type(imdb.head())

pandas.core.frame.DataFrame

In [35]:
imdb.tail(10)

,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,genres,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
5033,Color,Shane Carruth,143.0,77.0,291.0,8.0,David Sullivan,291.0,424760.0,Drama|Sci-Fi|Thriller,...,371.0,English,USA,PG-13,7000.0,2004.0,45.0,7.0,1.85,19000
5034,Color,Neill Dela Llana,35.0,80.0,0.0,0.0,Edgar Tancangco,0.0,70071.0,Thriller,...,35.0,English,Philippines,Not Rated,7000.0,2005.0,0.0,6.3,NaN,74
5035,Color,Robert Rodriguez,56.0,81.0,0.0,6.0,Peter Marquardt,121.0,2040920.0,Action|Crime|Drama|Romance|Thriller,...,130.0,Spanish,USA,R,7000.0,1992.0,20.0,6.9,1.37,0
5036,Color,Anthony Vallone,NaN,84.0,2.0,2.0,John Considine,45.0,NaN,Crime|Drama,...,1.0,English,USA,PG-13,3250.0,2005.0,44.0,7.8,NaN,4
5037,Color,Edward Burns,14.0,95.0,0.0,133.0,Caitlin FitzGerald,296.0,4584.0,Comedy|Drama,...,14.0,English,USA,Not Rated,9000.0,2011.0,205.0,6.4,NaN,413
5038,Color,Scott Smith,1.0,87.0,2.0,318.0,Daphne Zuniga,637.0,NaN,Comedy|Drama,...,6.0,English,Canada,NaN,NaN,2013.0,470.0,7.7,NaN,84
5039,Color,NaN,43.0,43.0,NaN,319.0,Valorie Curry,841.0,NaN,Crime|Drama|Mystery|Thriller,...,359.0,English,USA,TV-14,NaN,NaN,593.0,7.5,16.00,32000
5040,Color,Benjamin Roberds,13.0,76.0,0.0,0.0,Maxwell Moody,0.0,NaN,Drama|Horror|Thriller,...,3.0,English,USA,NaN,1400.0,2013.0,0.0,6.3,NaN,16
5041,Color,Daniel Hsia,14.0,100.0,0.0,489.0,Daniel Henney,946.0,10443.0,Comedy|Drama|Romance,...,9.0,English,USA,PG-13,NaN,2012.0,719.0,6.3,2.35,660
5042,Color,Jon Gunn,43.0,90.0,16.0,16.0,Brian Herzlinger,86.0,85222.0,Documentary,...,84.0,English,USA,PG,1100.0,2004.0,23.0,6.6,1.85,456

In [36]:
imdb[['color', 'director_name']]

      color      director_name
0     Color      James Cameron
1     Color     Gore Verbinski
2     Color         Sam Mendes
3     Color  Christopher Nolan
4       NaN        Doug Walker
...     ...                ...
5038  Color        Scott Smith
5039  Color                NaN
5040  Color   Benjamin Roberds
5041  Color        Daniel Hsia
5042  Color           Jon Gunn

[5043 rows x 2 columns]

In [37]:
sub = imdb[['director_name', 'movie_title', 'imdb_score']]

In [38]:
sub

,director_name,movie_title,imdb_score
0,James Cameron,Avatar,7.9
1,Gore Verbinski,Pirates of the Caribbean: At World's End,7.1
2,Sam Mendes,Spectre,6.8
3,Christopher Nolan,The Dark Knight Rises,8.5
4,Doug Walker,Star Wars: Episode VII - The Force Awakens ...,7.1
...,...,...,...
5038,Scott Smith,Signed Sealed Delivered,7.7
5039,NaN,The Following,7.5
5040,Benjamin Roberds,A Plague So Pleasant,6.3
5041,Daniel Hsia,Shanghai Calling,6.3
5042,Jon Gunn,My Date with Drew,6.6

In [39]:
sub.iloc[10:20, 0:2]

       director_name                                   movie_title
10       Zack Snyder           Batman v Superman: Dawn of Justice
11      Bryan Singer                             Superman Returns
12      Marc Forster                            Quantum of Solace
13    Gore Verbinski   Pirates of the Caribbean: Dead Man's Chest
14    Gore Verbinski                              The Lone Ranger
15       Zack Snyder                                 Man of Steel
16    Andrew Adamson     The Chronicles of Narnia: Prince Caspian
17       Joss Whedon                                 The Avengers
18      Rob Marshall  Pirates of the Caribbean: On Stranger Tides
19  Barry Sonnenfeld                               Men in Black 3

In [40]:
sub.loc[15:17, :'director_name']

     director_name
15     Zack Snyder
16  Andrew Adamson
17     Joss Whedon

In [41]:
s1 = Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])

In [42]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [43]:
s1.reindex(index=['A', 'B', 'C', 'D', 'E'])

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
dtype: float64

In [44]:
s1.reindex(index=['A', 'B', 'C', 'D', 'E'], fill_value=10)

A     1
B     2
C     3
D     4
E    10
dtype: int64

In [45]:
s2 = Series(['A', 'B', 'C'], index=[1, 5, 10])

In [46]:
s2

1     A
5     B
10    C
dtype: object

In [47]:
s2.reindex(range(15), method="ffill")

0     NaN
1       A
2       A
3       A
4       A
5       B
6       B
7       B
8       B
9       B
10      C
11      C
12      C
13      C
14      C
dtype: object

In [48]:
df1 = DataFrame(np.random.randint(25, size=25).reshape(5, 5), index=['A', 'B', 'D', 'E', 'F'], columns=['c1', 'c2', 'c3', 'c4', 'c5'])

In [49]:
df1

   c1  c2  c3  c4  c5
A   0   3  17  22  16
B  10  19  23  20  13
D  13   0   6   8  22
E   8  18   1  23   1
F  23   7  10  15  19

In [50]:
df1.reindex(index=['A', 'B', 'C', 'D', 'E', 'F'])

     c1    c2    c3    c4    c5
A   0.0   3.0  17.0  22.0  16.0
B  10.0  19.0  23.0  20.0  13.0
C   NaN   NaN   NaN   NaN   NaN
D  13.0   0.0   6.0   8.0  22.0
E   8.0  18.0   1.0  23.0   1.0
F  23.0   7.0  10.0  15.0  19.0

In [51]:
df1.reindex(columns=['c1', 'c2', 'c3', 'c4', 'c5', 'c6'])

   c1  c2  c3  c4  c5  c6
A   0   3  17  22  16 NaN
B  10  19  23  20  13 NaN
D  13   0   6   8  22 NaN
E   8  18   1  23   1 NaN
F  23   7  10  15  19 NaN

In [52]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [53]:
s1.drop('B')

A    1
C    3
D    4
dtype: int64

In [54]:
df1

   c1  c2  c3  c4  c5
A   0   3  17  22  16
B  10  19  23  20  13
D  13   0   6   8  22
E   8  18   1  23   1
F  23   7  10  15  19

In [55]:
df1.drop('A')

   c1  c2  c3  c4  c5
B  10  19  23  20  13
D  13   0   6   8  22
E   8  18   1  23   1
F  23   7  10  15  19

In [56]:
df1.drop('c1', axis=1)

   c2  c3  c4  c5
A   3  17  22  16
B  19  23  20  13
D   0   6   8  22
E  18   1  23   1
F   7  10  15  19

In [57]:
s1 = Series([1, 2, np.nan, 3, 4], ['A', 'B', 'C', 'D', 'E'])

In [58]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [59]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [60]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [61]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

In [62]:
df1 = DataFrame({"城市": ["北京", "上海", "广州"], "人口": [1000, 2000, 1500]})

In [63]:
df1

   城市    人口
0  北京  1000
1  上海  2000
2  广州  1500

In [64]:
df1['GDP'] = Series([100, 200, 500])

In [65]:
df1

   城市    人口  GDP
0  北京  1000  100
1  上海  2000  200
2  广州  1500  500

In [66]:
df1.drop('GDP', axis=1)

   城市    人口
0  北京  1000
1  上海  2000
2  广州  1500

In [67]:
df1 = df1.drop('GDP', axis=1)

In [68]:
df1

   城市    人口
0  北京  1000
1  上海  2000
2  广州  1500

In [69]:
gdp_map={"北京": 1000, "上海":2000, "广州": 1500}

In [70]:
gdp_map

{'北京': 1000, '上海': 2000, '广州': 1500}

In [71]:
df1['GDP'] = df1['城市'].map(gdp_map)

In [72]:
df1

   城市    人口   GDP
0  北京  1000  1000
1  上海  2000  2000
2  广州  1500  1500

In [73]:
s1 = Series(range(10, 100, 10))

In [74]:
s1

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [75]:
s1.replace(10, np.nan)

0     NaN
1    20.0
2    30.0
3    40.0
4    50.0
5    60.0
6    70.0
7    80.0
8    90.0
dtype: float64

In [76]:
s1.replace([10, 20, 50], np.nan)

0     NaN
1     NaN
2    30.0
3    40.0
4     NaN
5    60.0
6    70.0
7    80.0
8    90.0
dtype: float64

In [77]:
s1.replace([10, 20, 50], [1, 2, 5])

0     1
1     2
2    30
3    40
4     5
5    60
6    70
7    80
8    90
dtype: int64

In [78]:
s1.replace({10: 1, 20: 2, 50: 5})

0     1
1     2
2    30
3    40
4     5
5    60
6    70
7    80
8    90
dtype: int64

In [79]:
t_range = pd.date_range('2016-01-01', '2016-12-31', freq='D')

In [80]:
t_range

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10',
               ...
               '2016-12-22', '2016-12-23', '2016-12-24', '2016-12-25',
               '2016-12-26', '2016-12-27', '2016-12-28', '2016-12-29',
               '2016-12-30', '2016-12-31'],
              dtype='datetime64[ns]', length=366, freq='D')

In [81]:
s1 = Series(np.random.randn(len(t_range)), index=t_range)

In [82]:
s1

2016-01-01   -1.099440
2016-01-02   -1.159811
2016-01-03   -0.064994
2016-01-04   -0.962145
2016-01-05   -0.014035
                ...
2016-12-27   -2.168622
2016-12-28    0.458898
2016-12-29    0.937951
2016-12-30    0.745726
2016-12-31   -1.553699
Freq: D, Length: 366, dtype: float64

In [84]:
s1.head()

2016-01-01   -1.099440
2016-01-02   -1.159811
2016-01-03   -0.064994
2016-01-04   -0.962145
2016-01-05   -0.014035
Freq: D, dtype: float64

In [86]:
s1['2016-01'].mean()

-0.014200802817674236

In [87]:
s1_month = s1.resample('M').mean()

In [88]:
s1_month

2016-01-31   -0.014201
2016-02-29    0.260481
2016-03-31    0.053620
2016-04-30   -0.076609
2016-05-31    0.058052
2016-06-30   -0.017610
2016-07-31   -0.388838
2016-08-31    0.008768
2016-09-30    0.059363
2016-10-31   -0.211061
2016-11-30   -0.021498
2016-12-31    0.053162
Freq: M, dtype: float64

In [90]:
s1

2016-01-01   -1.099440
2016-01-02   -1.159811
2016-01-03   -0.064994
2016-01-04   -0.962145
2016-01-05   -0.014035
                ...
2016-12-27   -2.168622
2016-12-28    0.458898
2016-12-29    0.937951
2016-12-30    0.745726
2016-12-31   -1.553699
Freq: D, Length: 366, dtype: float64